evidencias/metricas_finais/metricas_finais_rest.txt
====================================================================
Metricas Finais - Arquitetura REST
Data/Hora: 2026-08-16 20:17:10
Script k6: k6/test-rest.js
PID monitorado (processo Spring Boot): 26288
k6 exit code: 0
====================================================================

----- LOG COMPLETO DO K6 -----

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: test-rest.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 02/10 VUs, 71 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  02.0s/50.0s

running (0m03.0s), 03/10 VUs, 253 complete and 0 interrupted iterations
default   [   6% ] 03/10 VUs  03.0s/50.0s

running (0m03.9s), 04/10 VUs, 523 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  04.0s/50.0s

running (0m04.9s), 05/10 VUs, 796 complete and 0 interrupted iterations
default   [  10% ] 05/10 VUs  05.0s/50.0s

running (0m05.9s), 06/10 VUs, 1090 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  06.0s/50.0s

running (0m06.9s), 07/10 VUs, 1510 complete and 0 interrupted iterations
default   [  14% ] 07/10 VUs  07.0s/50.0s

running (0m07.9s), 08/10 VUs, 1912 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  08.0s/50.0s

running (0m08.9s), 09/10 VUs, 2389 complete and 0 interrupted iterations
default   [  18% ] 09/10 VUs  09.0s/50.0s

running (0m09.9s), 09/10 VUs, 2887 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  10.0s/50.0s

running (0m10.9s), 10/10 VUs, 3390 complete and 0 interrupted iterations
default   [  22% ] 10/10 VUs  11.0s/50.0s

running (0m11.9s), 10/10 VUs, 3869 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  12.0s/50.0s

running (0m12.9s), 10/10 VUs, 4420 complete and 0 interrupted iterations
default   [  26% ] 10/10 VUs  13.0s/50.0s

running (0m13.9s), 10/10 VUs, 4930 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  14.0s/50.0s

running (0m14.9s), 10/10 VUs, 5409 complete and 0 interrupted iterations
default   [  30% ] 10/10 VUs  15.0s/50.0s

running (0m15.9s), 10/10 VUs, 6030 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  16.0s/50.0s

running (0m16.9s), 10/10 VUs, 6606 complete and 0 interrupted iterations
default   [  34% ] 10/10 VUs  17.0s/50.0s

running (0m17.9s), 10/10 VUs, 7186 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  18.0s/50.0s

running (0m18.9s), 10/10 VUs, 7812 complete and 0 interrupted iterations
default   [  38% ] 10/10 VUs  19.0s/50.0s

running (0m19.9s), 10/10 VUs, 8362 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  20.0s/50.0s

running (0m20.9s), 10/10 VUs, 8854 complete and 0 interrupted iterations
default   [  42% ] 10/10 VUs  21.0s/50.0s

running (0m21.9s), 10/10 VUs, 9394 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  22.0s/50.0s

running (0m22.9s), 10/10 VUs, 10058 complete and 0 interrupted iterations
default   [  46% ] 10/10 VUs  23.0s/50.0s

running (0m23.9s), 10/10 VUs, 10668 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  24.0s/50.0s

running (0m24.9s), 10/10 VUs, 11207 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  25.0s/50.0s

running (0m25.9s), 10/10 VUs, 11863 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  26.0s/50.0s

running (0m26.9s), 10/10 VUs, 12506 complete and 0 interrupted iterations
default   [  54% ] 10/10 VUs  27.0s/50.0s

running (0m27.9s), 10/10 VUs, 13139 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  28.0s/50.0s

running (0m28.9s), 10/10 VUs, 13673 complete and 0 interrupted iterations
default   [  58% ] 10/10 VUs  29.0s/50.0s

running (0m29.9s), 10/10 VUs, 14312 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  30.0s/50.0s

running (0m30.9s), 10/10 VUs, 14940 complete and 0 interrupted iterations
default   [  62% ] 10/10 VUs  31.0s/50.0s

running (0m31.9s), 10/10 VUs, 15495 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  32.0s/50.0s

running (0m32.9s), 10/10 VUs, 16150 complete and 0 interrupted iterations
default   [  66% ] 10/10 VUs  33.0s/50.0s

running (0m33.9s), 10/10 VUs, 16747 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  34.0s/50.0s

running (0m34.9s), 10/10 VUs, 17158 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  35.0s/50.0s

running (0m35.9s), 10/10 VUs, 17475 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  36.0s/50.0s

running (0m36.9s), 10/10 VUs, 17991 complete and 0 interrupted iterations
default   [  74% ] 10/10 VUs  37.0s/50.0s

running (0m37.9s), 10/10 VUs, 18403 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  38.0s/50.0s

running (0m38.9s), 10/10 VUs, 18749 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  39.0s/50.0s

running (0m39.9s), 10/10 VUs, 19103 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  40.0s/50.0s

running (0m40.9s), 10/10 VUs, 19480 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m41.9s), 10/10 VUs, 19812 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  42.0s/50.0s

running (0m42.9s), 09/10 VUs, 20095 complete and 0 interrupted iterations
default   [  86% ] 09/10 VUs  43.0s/50.0s

running (0m43.9s), 09/10 VUs, 20365 complete and 0 interrupted iterations
default   [  88% ] 09/10 VUs  44.0s/50.0s

running (0m44.9s), 09/10 VUs, 20638 complete and 0 interrupted iterations
default   [  90% ] 09/10 VUs  45.0s/50.0s

running (0m45.9s), 09/10 VUs, 20899 complete and 0 interrupted iterations
default   [  92% ] 09/10 VUs  46.0s/50.0s

running (0m46.9s), 08/10 VUs, 21072 complete and 0 interrupted iterations
default   [  94% ] 08/10 VUs  47.0s/50.0s

running (0m47.9s), 08/10 VUs, 21246 complete and 0 interrupted iterations
default   [  96% ] 08/10 VUs  48.0s/50.0s

running (0m48.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default   [  98% ] 07/10 VUs  49.0s/50.0s

running (0m49.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default   [ 100% ] 07/10 VUs  50.0s/50.0s

running (0m50.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m51.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m52.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m53.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m54.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m55.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m56.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m57.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m58.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (0m59.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (1m00.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (1m01.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (1m02.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s

running (1m03.9s), 07/10 VUs, 21252 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s
docker.exe : time="2026-08-16T23:17:06Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o 
timeout"
No C:\Users\wagne\IdeaProjects\tcc-api-performance\run-performance-tests.ps1:286 caractere:5
+     & docker @dockerArgs 2>&1 | Tee-Object -FilePath $k6LogPath
+     ~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-08-1...l: i/o timeout":String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
time="2026-08-16T23:17:06Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"
time="2026-08-16T23:17:06Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m04.9s), 04/10 VUs, 21255 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s
time="2026-08-16T23:17:07Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m05.9s), 03/10 VUs, 21256 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s
time="2026-08-16T23:17:08Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"

running (1m06.9s), 02/10 VUs, 21257 complete and 0 interrupted iterations
default ↓ [ 100% ] 07/10 VUs  50s
time="2026-08-16T23:17:08Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"
time="2026-08-16T23:17:09Z" level=warning msg="Request Failed" error="Post \"http://host.docker.internal:8085/produtos\": dial: i/o timeout"


  █ TOTAL RESULTS 

    checks_total.......: 21259  314.459883/s
    checks_succeeded...: 99.96% 21252 out of 21259
    checks_failed......: 0.03%  7 out of 21259

    ✗ status is 201
      ↳  99% — ✓ 21252 / ✗ 7

    HTTP
    http_req_duration..............: avg=15.32ms min=-14186843ns med=14.65ms max=937.75ms p(90)=22.32ms p(95)=25.86ms
      { expected_response:true }...: avg=15.33ms min=-14186843ns med=14.65ms max=937.75ms p(90)=22.32ms p(95)=25.86ms
    http_req_failed................: 0.03%  7 out of 21259
    http_reqs......................: 21259  314.459883/s

    EXECUTION
    iteration_duration.............: avg=25.65ms min=5.03ms      med=15.09ms max=30s      p(90)=22.95ms p(95)=26.64ms
    iterations.....................: 21259  314.459883/s
    vus............................: 2      min=1          max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 6.3 MB 93 kB/s
    data_sent......................: 4.5 MB 67 kB/s



running (1m07.6s), 00/10 VUs, 21259 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  50s


----- METRICAS DE PICO (processo da aplicacao durante o teste) -----
Pico Maximo de CPU (%): 319.23
Pico Maximo de Memoria (MB): 275.35
====================================================================